In [2]:
datafile = "\\titanicdata.htm" #web scrapping

In [7]:
from bs4 import BeautifulSoup
with open(datafile,"r",encoding="Latin-1") as f:
    soup = BeautifulSoup(f,"html.parser")

In [8]:
table = soup.find('table')

In [9]:
import pandas as pd
data = data = pd.read_html(str(table).encode('ascii', errors='replace'), flavor='bs4')[0]

In [10]:
data.head()

,Name,Age,Class/Dept,Ticket,Joined,Job,Boat [Body],Unnamed: 7
0,"AB??-AL-MUN??, Mr N??s??f Q??sim",27,3rd Class Passenger,2699?18 15s 9d,Cherbourg,?,15?,NaN
1,"ABBING, Mr Anthony",42,3rd Class Passenger,5547?7 11s,Southampton,Blacksmith ?,??,NaN
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,CA2673?20 5s,Southampton,?,A?,NaN
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,CA2673?20 5s,Southampton,Jeweller ?,?[190],NaN
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,CA2673?20 5s,Southampton,Scholar ?,??,NaN

In [11]:
def cleanup(value):
    return value.replace("?", " ")

data['Name']= data['Name'].apply(cleanup)
data['Boat [Body]']= data['Boat [Body]'].apply(cleanup)
data['Age'] = data['Age'].apply(pd.to_numeric, errors='coerce')
data = data[["Name","Age","Class/Dept","Boat [Body]"]]

data.head()

                               Name   Age           Class/Dept Boat [Body]
0  AB  -AL-MUN  , Mr N  s  f Q  sim  27.0  3rd Class Passenger         15
1                ABBING, Mr Anthony  42.0  3rd Class Passenger
2     ABBOTT, Mrs Rhoda Mary 'Rosa'  39.0  3rd Class Passenger          A
3        ABBOTT, Mr Rossmore Edward  16.0  3rd Class Passenger       [190]
4          ABBOTT, Mr Eugene Joseph  13.0  3rd Class Passenger

In [12]:
def checkPass(class_type):
    if "Passenger" in class_type:
        return "Passenger"
    else:
        return "Crew"
    
data["Crew/Pass"]=data["Class/Dept"].apply(checkPass)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass
0,"AB -AL-MUN , Mr N s f Q sim",27.0,3rd Class Passenger,15,Passenger
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger

In [13]:
def checkClass(class_type):
    if "Passenger" in class_type:
        return class_type.split(" ")[0]
    else:
        return "Crew"
    
data["Class"]=data["Class/Dept"].apply(checkClass)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class
0,"AB -AL-MUN , Mr N s f Q sim",27.0,3rd Class Passenger,15,Passenger,3rd
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd

In [14]:
def checkAdult(age):
    if age>=18:
        return "Adult"
    else:
        return "Child"
    
data["Adult/Child"]=data["Age"].apply(checkAdult)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child
0,"AB -AL-MUN , Mr N s f Q sim",27.0,3rd Class Passenger,15,Passenger,3rd,Adult
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd,Adult
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd,Adult
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd,Child
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd,Child

In [15]:
def checkGender(name):
    firstname = name[name.index(",")+2:]
    salutation = firstname.split(" ")[0]
    if salutation in ["Mr","Master"]:
        return "Male"
    else:
        return "Female"

In [16]:
data["Gender"]=data["Name"].apply(checkGender)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender
0,"AB -AL-MUN , Mr N s f Q sim",27.0,3rd Class Passenger,15,Passenger,3rd,Adult,Male
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd,Adult,Male
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd,Adult,Female
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd,Child,Male
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd,Child,Male

In [17]:
def checkSurvival(boat):
    if boat.strip()=="" or "[" in boat:
        return 0
    else:
        return 1
data["Survival"]=data["Boat [Body]"].apply(checkSurvival)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender,Survival
0,"AB -AL-MUN , Mr N s f Q sim",27.0,3rd Class Passenger,15,Passenger,3rd,Adult,Male,1
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd,Adult,Male,0
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd,Adult,Female,1
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd,Child,Male,0
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd,Child,Male,0

In [18]:
data.groupby(['Crew/Pass'])['Survival'].sum()*100/data.groupby(['Crew/Pass'])['Survival'].count()

Crew/Pass
Crew         13.586957
Passenger    35.798817
Name: Survival, dtype: float64

In [19]:
def compare(group,data):
    return data.groupby([group])['Survival'].sum()*100/data.groupby([group])['Survival'].count()

compare("Class",data)

Class
1st     57.428571
2nd     37.883959
3rd     24.259520
Crew    13.586957
Name: Survival, dtype: float64

In [20]:
compare("Gender",data)

Gender
Female    59.272097
Male      15.540181
Name: Survival, dtype: float64

In [21]:
compare("Adult/Child",data)

Adult/Child
Adult    25.078370
Child    33.183857
Name: Survival, dtype: float64

In [22]:
trainingData=data[["Age","Crew/Pass","Class","Adult/Child","Gender","Survival"]]
trainingData.head()

    Age  Crew/Pass Class Adult/Child  Gender  Survival
0  27.0  Passenger   3rd       Adult    Male         1
1  42.0  Passenger   3rd       Adult    Male         0
2  39.0  Passenger   3rd       Adult  Female         1
3  16.0  Passenger   3rd       Child    Male         0
4  13.0  Passenger   3rd       Child    Male         0

In [23]:
def catToNum(series):
    series = series.astype('category')
    return series.cat.codes

catData=trainingData[["Crew/Pass","Class","Adult/Child","Gender"]].apply(catToNum)
trainingData[["Crew/Pass","Class","Adult/Child","Gender"]]=catData
trainingData.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:2540: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[k1] = value[k2]

    Age  Crew/Pass  Class  Adult/Child  Gender  Survival
0  27.0          1      2            0       1         1
1  42.0          1      2            0       1         0
2  39.0          1      2            0       0         1
3  16.0          1      2            1       1         0
4  13.0          1      2            1       1         0

In [24]:
len(trainingData)

2456

In [25]:
trainingData = trainingData.dropna()
len(trainingData)

2426

In [26]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(trainingData, test_size = 0.2) #stratify, random not done here

In [27]:
train.head()

       Age  Crew/Pass  Class  Adult/Child  Gender  Survival
1183  46.0          1      1            0       0         1
207   39.0          0      3            0       1         0
1355  29.0          1      2            0       1         1
852   13.0          1      2            1       1         0
1093  20.0          0      3            0       1         0

In [28]:
test.head()

       Age  Crew/Pass  Class  Adult/Child  Gender  Survival
2258   9.0          1      2            1       0         1
783   30.0          0      3            0       1         0
1068  18.0          0      3            0       1         0
733   18.0          1      2            0       1         0
1930  33.0          1      0            0       0         1

In [29]:
len(train)

1940

In [30]:
len(test)

486

In [31]:
from sklearn.tree import DecisionTreeClassifier
clf=DecisionTreeClassifier(max_leaf_nodes=25)
clf=clf.fit(train[["Age","Crew/Pass","Class","Adult/Child","Gender"]],train["Survival"])

In [32]:
clf

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=25,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [33]:
clf.feature_importances_ # this gives the importance value, if the value is 0, then they are not important, they dont give a good split

array([0.17893036, 0.        , 0.27458238, 0.        , 0.54648726])

In [34]:
from sklearn import tree
with open("titanic.dot","w") as f:
    f = tree.export_graphviz(clf,
                            feature_names=["Age","Crew/Pass","Class","Adult/Child","Gender"],out_file=f)

In [35]:
predictions = clf.predict(test[["Age","Crew/Pass","Class","Adult/Child","Gender"]])

In [36]:
from sklearn.metrics import accuracy_score
accuracy_score(test["Survival"], predictions)

0.7716049382716049

In [37]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier(n_estimators=1000,max_leaf_nodes=15)

In [38]:
clf

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=15,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=1000, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [39]:
def checkAccuracy(clf):
    clf=clf.fit(train[["Age","Crew/Pass","Class","Adult/Child","Gender"]],train["Survival"])
    predictions = clf.predict(test[["Age","Crew/Pass","Class","Adult/Child","Gender"]])
    return accuracy_score(test["Survival"], predictions)

In [40]:
checkAccuracy(clf)

0.7880658436213992

In [41]:
#There are known issues while installing xgboost on windows. Hence, commented the below code

In [42]:
#from xgboost.sklearn import XGBClassifier

In [43]:
#clf = XGBClassifier(n_estimators=1000)

In [44]:
#checkAccuracy(clf)

In [45]:
#clf

In [46]:
from hyperopt import fmin, tpe, hp, STATUS_OK,Trials

In [47]:
space ={
    'n_estimators':hp.quniform('n_estimators',100,1000,1),
    'max_depth':hp.quniform('max_depth',1,13,1),
    'max_leaf_nodes': hp.quniform('max_leaf_nodes',5,100,1),
    'min_samples_split': hp.quniform('min_samples_split',2,100,1)
}

In [48]:
def score(params):
    params['n_estimators']=int(params['n_estimators'])
    params['min_samples_split']=int(params['min_samples_split'])
    params['max_leaf_nodes']=int(params['max_leaf_nodes'])
    clf = RandomForestClassifier(**params)
    return {'loss':1-checkAccuracy(clf),'status':STATUS_OK}

In [49]:
trials=Trials()

In [50]:
best=fmin(score,space,algo=tpe.suggest,trials=trials,max_evals=250)

In [51]:
print(best)

{'max_depth': 4.0, 'max_leaf_nodes': 19.0, 'min_samples_split': 75.0, 'n_estimators': 720.0}

In [52]:
1-score(best)['loss']

0.7901234567901234